benchmark/graphql.yaml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 180
      arrivalRate: 25
      rampTo: 250
      name: 'light phase'
    - duration: 180
      arrivalRate: 50
      rampTo: 500
      name: 'medium phase'
    - duration: 180
      arrivalRate: 100
      rampTo: 1000
      name: 'heavy phase'
  payload:
    path: 'zkapp.csv'
    skipHeader: true
    fields:
      - 'address'
scenarios:
  - name: 'Get Events'
    flow:
      - post:
          url: '/'
          json:
            query: |
              query GetEventsQuery($input: EventFilterOptionsInput!) {
                events(input: $input) {
                  blockInfo {
                    stateHash
                    timestamp
                    height
                    parentHash
                    chainStatus
                    ledgerHash
                    chainStatus
                    globalSlotSinceGenesis
                    globalSlotSinceHardfork
                    distanceFromMaxBlockHeight
                  }
                  eventData {
                    data
                    transactionInfo {
                      status
                      hash
                      memo
                    }
                  }
                }
              }
            variables:
              input:
                address: '{{ address }}'
          expect:
            - statusCode: 200
  - name: 'Get Actions'
    flow:
      - post:
          url: '/'
          json:
            query: |
              query GetActionsQuery($input: ActionFilterOptionsInput!) {
                actions(input: $input) {
                  blockInfo {
                    stateHash
                    timestamp
                    height
                    parentHash
                    chainStatus
                    ledgerHash
                    chainStatus
                    globalSlotSinceGenesis
                    globalSlotSinceHardfork
                    distanceFromMaxBlockHeight
                  }
                  actionState {
                    actionStateOne
                    actionStateTwo
                    actionStateThree
                    actionStateFour
                    actionStateFive
                  }
                  actionData {
                    data
                    accountUpdateId
                    transactionInfo {
                      status
                      hash
                      memo
                    }
                  }
                }
              }
            variables:
              input:
                address: '{{ address }}'
          expect:
            - statusCode: 200